from turtle import*
# ЗАВДАННЯ 1: Правильний восьмикутник
# Використовуючи цикл for, намалюй восьмикутник зі стороною 80 пікселів. 
# Обчисли кут повороту за формулою (360 / кількість сторін).
# for i in range(5):
#     forward(80)
#     left(360/5)

# ЗАВДАННЯ 2: Квадратна "мушля"
# Напиши цикл на 40 ітерацій. На кожному кроці черепашка проходить 
# відстань (i * 4) та повертає на 90 градусів. Це створить розгорнутий квадрат.
# for i in range(40):
#     forward(i*4)
#     right(90)#
# ЗАВДАННЯ 3: Віяло з ліній
# Намалюй 24 лінії довжиною 150 пікселів, що виходять з центру. 
# Після кожної лінії використовуй backward(150), щоб повернутися в центр, 
# і поверни праворуч на 15 градусів.
# for i in range(28):
#     forward(150)
#     backward(150)
#     right(360/28)
# ЗАВДАННЯ 4: Спіраль із кіл
# Використовуй цикл, щоб намалювати 20 кіл. Радіус кожного кола 
# має бути однаковим (наприклад, 50), але після кожного кола 
# черепашка повинна пройти вперед на 10 пікселів і повернути на 18 градусів.
# for i in range(20):
#     circle(50)
#     forward(10)
#     left(18)

# ЗАВДАННЯ 5: Паркан
# Намалюй 15 вертикальних ліній (висот 100), розташованих паралельно. 
# Між кожною лінією роби перехід з піднятим пером (penup) на 15 пікселів.
def drow_wood():
    begin_fill()
    forward(30)
    left(90)
    forward(150)
    left(30)
    forward(30)
    left(120)
    forward(30)
    left(30)
    forward(150)
    left(90)
    end_fill()

for i in range(15):
    drow_wood()
    penup()
    forward(40)
    pendown()

exitonclick()