# 1. Створіть змінну x = "15". Перетворіть її на ціле число (int) і додайте 5.
# x = "15"
# x = int(x)
# x = x+5
# print(x)
# 2. Дано число y = 12.5. Перетворіть його на рядок (str) і виведіть тип отриманої змінної.
# y = 12.5
# y = str(y)
# print(type(y))
# 3. Перетворіть число z = 10 на число з рухомою комою (float). Який результат ви отримаєте?
# z = 10
# z = float(z)
# print(z)
# 4. Створіть змінну s = "3.14". Перетворіть її спочатку на float, а потім отриманий результат — на int. 
#    Що станеться з дробовою частиною?
# s = "3.14"
# s = float(s)
# s = int(s)
# print(s)
# 5. Користувач вводить число через input(). Напишіть код, який зчитує це значення, 
#    перетворює його на int і множить на 2.
# number = input(f"enter number ")
# number = int(number)
# number = number*2
# print(number)
# 6. Дано два рядки: a = "10" та b = "20". Перетворіть їх на числа, додайте одне до одного 
#    і виведіть результат як рядок.
# a = "10"
# a = int(a)
# b = "20"
# b = int(b)
# print(a+b)
# c = str(a+b)
# 7. Спробуйте перетворити рядок "Hello" на int. Яку помилку ви отримаєте? 
#    (Запишіть назву помилки в коментарі).
# h = "hello"
# h = int(h)
# 8. Дано float-число 9.99. Перетворіть його на int. Чи відбудеться округлення 
#    чи просто відкидання дробової частини?
# n = 9.99
# n = int(n)
# print(n)
# 9. Створіть змінну-результат, яка є сумою цілого числа 5 та float-числа 4.5. 
#    Якого типу автоматично стане результат?
# result = 5+4.5
# print(result)
# 10. Перетворіть результат ділення 10 / 2 на тип int, оскільки оператор "/" 
#     завжди повертає float.
result = 10/2
result = int(result)
print(result)